ALLOWED_SYMBOLS = (
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 'K', 'L', 'M',
    'N', 'P', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9'
)

WMI_MANUFACTURERS = {
    # США (1xx, 4xx, 5xx)
    '1G1': 'Chevrolet (GM)',
    '1G2': 'Pontiac (GM)',
    '1G3': 'Oldsmobile (GM)',
    '1G4': 'Buick (GM)',
    '1GC': 'Chevrolet Trucks (GM)',
    '1HG': 'Honda',
    '1FM': 'Ford MPV',
    '1FT': 'Ford Trucks',
    '1FMD': 'Ford MPV 4x4',
    '1GKE': 'GMC Trucks',
    '2G1': 'Pontiac (GM)',
    '3VW': 'Volkswagen',
    '4T1': 'Toyota',
    '5FN': 'Honda MPV',
    '5TD': 'Toyota Trucks',

    # Япония (Jxx)
    'JHM': 'Honda',
    'JN1': 'Nissan',
    'JNK': 'Infiniti',
    'JTE': 'Toyota Trucks',
    'JT2': 'Toyota Passenger',
    'KL1': 'Chevrolet (GM Korea)',

    # Германия (Wxx, Txx)
    'WBA': 'BMW Passenger',
    'WBS': 'BMW Sports',
    'WDB': 'Mercedes-Benz',
    'WF0': 'Ford (Европа)',
    'WVW': 'Volkswagen Passenger',
    'WV1': 'Volkswagen Trucks',
    'WME': 'Smart',

    # Россия/СНГ (Xxx)
    'XTA': 'АвтоВАЗ (LADA)',
    'XTH': 'ГАЗ',
    'XRE': 'КАМАЗ',
    'XTE': 'ЗАЗ',
    'XWF': 'АвтоТОР (Калининград)',
    'X0C': 'ТагАЗ',

    # Франция (Vxx)
    'VF1': 'Renault',
    'VF3': 'Peugeot',
    'VSS': 'Citroën',

    # Корея (Kxx)
    'KMH': 'Hyundai Passenger',
    'KNA': 'Kia Passenger',
    'KLT': 'Hyundai Trucks',

    # Китай (Lxx)
    'LHQ': 'Dongfeng',
    'LSV': 'SAIC (Roewe/MG)',
    'LVV': 'Chery',

    # Великобритания (Sxx)
    'SAJ': 'Jaguar',
    'SAR': 'Rover',

    # Италия (Zxx)
    'ZFA': 'Fiat',
    'ZFB': 'Iveco',

    # Бразилия (9xx)
    '9BW': 'VW Бразилия',
    '9FC': 'Ford Бразилия',
}

COUNTRY_CODES = {
    # Северная Америка
    '1': 'США',
    '4': 'США',
    '5': 'США / Канада / Мексика',

    # Азия
    'J': 'Япония',
    'K': 'Южная Корея',
    'L': 'Китай',
    'M': 'Китай / Индия',
    'N': 'Бразилия / Аргентина',
    'P': 'Филиппины / Малайзия / Таиланд',

    # Европа
    'R': 'Россия / СНГ (Беларусь, Украина)',
    'S': 'Великобритания / Ирландия',
    'T': 'Германия / Венгрия / Чехия',
    'V': 'Франция / Испания / Италия',
    'W': 'Германия / Австрия / Швеция',
    'Z': 'Италия / Чехия / Румыния / Беларусь',

    # Африка
    'A': "ЮАР / Кот-д'Ивуар / Ангола",
    'B': 'Кения / Танзания',
    'C': 'Бенин / Мадагаскар / Тунис',
    'D': 'Египет / Марокко / Замбия',
    'E': 'Эфиопия / Мозамбик / Гана',
    'F': 'Нигерия',

    # Южная Америка/Океания
    '6': 'Океания (Австралия / Новая Зеландия)',
    '8': 'Аргентина / Чили / Бразилия',
    '9': 'Бразилия'
}

YEAR_CODES = {
    '1': 2001, '2': 2002, '3': 2003, '4': 2004, '5': 2005,
    '6': 2006, '7': 2007, '8': 2008, '9': 2009, 'A': 2010,
    'B': 2011, 'C': 2012, 'D': 2013, 'E': 2014, 'F': 2015,
    'G': 2016, 'H': 2017, 'J': 2018, 'K': 2019, 'L': 2020,
    'M': 2021, 'N': 2022, 'P': 2023, 'R': 2024, 'S': 2025,
    'T': 2026,
    # 'V': 2027,
    # 'W': 2028,
    # 'X': 2029,
    # 'Y': 2030,
    # '1': 2031,
    # '2': 2032,
    # '3': 2033,
    # '4': 2034,
    # '5': 2035,
    # '6': 2036,
    # '7': 2037,
    # '8': 2038,
    # '9': 2039,
}
